#pragma once

/* 第5章 软件工程基础知识
	约11分，占比15%

	5.1 软件工程概述
		5.1.1 计算机软件
		5.1.2 软件工程基本原理
		5.1.3 软件生存周期
		5.1.4 软件过程
	5.2 软件过程模型
		5.2.1 瀑布模型（Waterfall Model）
		5.2.2 增量模型（Incremental Model）
		5.2.3 演化模型（Evolutionary Model）
		5.2.4 喷泉模型（Water Fountain Model）
		5.2.5 基于构件的开发模型（Component-based Development Model）
		5.2.6 形式化方法模型（Formal Methods Model）
		5.2.7 统一过程（UP）模型
		5.2.8 敏捷方法（Agile Development）
	5.3 需求分析
		5.3.1 软件需求
		5.3.2 需求分析原则
		5.3.3 需求工程
	5.4 系统设计
		5.4.1 概要设计
		5.4.2 详细设计
	5.5 系统测试
		5.5.1 系统测试与调试
		5.5.2 传统软件的测试策略
		5.5.3 测试面向对象软件
		5.5.4 测试Web应用
		5.5.5 测试方法
	5.5.6 调试
		5.6 运行和维护知识
		5.6.1 系统转换
		5.6.2 系统维护概述
		5.6.3 系统评价
	5.7 软件项目管理
		5.7.1 软件项目管理涉及的范围
		5.7.2 软件项目估算
		5.7.3 进度管理
		5.7.4 软件项目的组织
		5.7.5 软件配置管理
		5.7.6 风险管理
	5.8 软件质量
		5.8.1 软件质量特性
		5.8.2 软件质量保证
		5.8.3 软件评审
		5.8.4 软件容错技术
	5.9 软件度量
		5.9.1 软件度量分类
		5.9.2 软件复杂性度量
	5.10 软件工具与软件开发环境
		5.10.1 软件工具
		5.10.2 软件开发环境
*/
class Chapter5
{
};

