#pragma once

/* 第9章 数据库技术基础
	约6分，占比8%

	9.1 基本概念
		9.1.1 数据库与数据库系统
		9.1.2 数据库管理系统的功能
		9.1.3 数据库管理系统的特征及分类
		9.1.4 数据库系统的体系结构
		9.1.5 数据库的三级模式结构
		9.1.6 大数据
	9.2 数据模型
		9.2.1 基本概念
		9.2.2 数据模型的三要素
		9.2.3 E-R模型
		9.2.4 数据模型
		9.2.5 关系模型
	9.3 关系代数
		9.3.1 关系数据库的基本概念
		9.3.2 5种基本的关系代数运算
		9.3.3 扩展的关系代数运算
	9.4 关系数据库SQL语言简介
		9.4.1 SQL数据库体系结构
		9.4.2 SQL的基本组成
		9.4.3 SQL数据定义
		9.4.4 SQL数据查询
		9.4.5 SQL数据更新
		9.4.6 SQL访问控制
		9.4.7 嵌入式SQL
	9.5 关系数据库的规范化
		9.5.1 函数依赖
		9.5.2 规范化
		9.5.3 模式分解及分解应具有的特性
	9.6 数据库的控制功能
		9.6.1 事务管理
		9.6.2 数据库的备份与恢复
		9.6.3 并发控制
*/
class Chapter9
{
public:
	Chapter9();
};

