#pragma once

/* 第4章 操作系统知识
	约6分，占比8%

	4.1 操作系统概述
		4.1.1 操作系统的基本概念
		4.1.2 操作系统分类及特点
		4.1.3 操作系统的发展
	4.2 进程管理
		4.2.1 基本概念
		4.2.2 进程的控制
		4.2.3 进程间的通信
		4.2.4 管程
		4.2.5 进程调度
		4.2.6 死锁
		4.2.7 线程
	4.3 存储管理
		4.3.1 基本概念
		4.3.2 存储管理方案
		4.3.3 分页存储管理
		4.3.4 分段存储管理
		4.3.5 段页式存储管理
		4.3.6 虚拟存储管理
	4.4 设备管理
		4.4.1 设备管理概述
		4.4.2 I/O软件
		4.4.3 设备管理采用的相关技术
		4.4.4 磁盘调度
	4.5 文件管理
		4.5.1 文件与文件系统
		4.5.2 文件的结构和组织
		4.5.3 文件目录
		4.5.4 存取方法和存储空间的管理
		4.5.5 文件的使用
		4.5.6 文件的共享和保护
		4.5.7 系统的安全与可靠性
	4.6 作业管理
		4.6.1 作业与作业控制
		4.6.2 作业调度
		4.6.3 用户界面
*/
class Chapter4
{
};

